{
    "id":  "a7b6f40a-5391-4830-9a1a-23a544d2d5a8",
    "displayName":  "BYOD-Good-Require MFA for Office 365 and Bing using Approved Apps on iOS",
    "createdDateTime":  "2020-07-02T13:10:08.0966949Z",
    "modifiedDateTime":  null,
    "state":  "enabledForReportingButNotEnforced",
    "sessionControls":  null,
    "conditions":  {
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes":  [
                                              "mobileAppsAndDesktopClients"
                                          ],
                       "locations":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "9ea1ad79-fdb6-4f9a-8bc3-2b70f96e34c7",
                                                                        "Office365"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ]
                                        },
                       "users":  {
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [
                                                           "BYOD-Best-Mobile Device-Users-Enabled",
                                                           "BYOD-Better-Mobile Device-Users-Enabled",
                                                           "BYOD-Good-Mobile Device-Users-Enabled"
                                                       ],
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 },
                       "platforms":  {
                                         "includePlatforms":  [
                                                                  "iOS"
                                                              ],
                                         "excludePlatforms":  [

                                                              ]
                                     }
                   },
    "grantControls":  {
                          "operator":  "AND",
                          "builtInControls":  [
                                                  "mfa",
                                                  "approvedApplication"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      }
}
