{
    "id":  "6b36d6c6-5c84-43f6-bd90-c15fb173c2e8",
    "displayName":  "BYOD-Good-Require MFA for Office 365 using Browser Only on PC or Mac",
    "createdDateTime":  null,
    "modifiedDateTime":  "2020-07-02T08:19:57.12252Z",
    "state":  "disabled",
    "conditions":  {
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes":  [
                                              "browser"
                                          ],
                       "locations":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "Office365"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ]
                                        },
                       "users":  {
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [
                                                           "BYOD-Good-PC-Users-Enabled"
                                                       ],
                                     "excludeGroups":  [
                                                           "BYOD-Best-PC-Users-Enabled ",
                                                           "BYOD-Better-PC-Users-Enabled"
                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 },
                       "platforms":  {
                                         "includePlatforms":  [
                                                                  "all"
                                                              ],
                                         "excludePlatforms":  [
                                                                  "android",
                                                                  "iOS"
                                                              ]
                                     }
                   },
    "grantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                                  "mfa"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      },
    "sessionControls":  {
                            "cloudAppSecurity":  null,
                            "signInFrequency":  null,
                            "persistentBrowser":  null,
                            "applicationEnforcedRestrictions":  {
                                                                    "isEnabled":  true
                                                                }
                        }
}
