{
    "@odata.context":  "https://graph.microsoft.com/Beta/$metadata#deviceAppManagement/iosManagedAppProtections(apps(),assignments())/$entity",
    "displayName":  "BYOD-iOS-AppProtectionPolicy",
    "description":  "",
    "createdDateTime":  "2020-07-08T19:00:59.663317Z",
    "lastModifiedDateTime":  "2020-07-08T19:00:59Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "T_5a443fb0-d722-4d79-b946-52899ef8df5e",
    "version":  "\"6a929bee-99fd-4f95-a601-0d16e1c5e8db\"",
    "periodOfflineBeforeAccessCheck":  "PT12H",
    "periodOnlineBeforeAccessCheck":  "PT10M",
    "allowedInboundDataTransferSources":  "managedApps",
    "allowedOutboundDataTransferDestinations":  "managedApps",
    "organizationalCredentialsRequired":  false,
    "allowedOutboundClipboardSharingLevel":  "managedApps",
    "dataBackupBlocked":  true,
    "deviceComplianceRequired":  true,
    "managedBrowserToOpenLinksRequired":  true,
    "saveAsBlocked":  true,
    "periodOfflineBeforeWipeIsEnforced":  "P90D",
    "pinRequired":  true,
    "maximumPinRetries":  5,
    "simplePinBlocked":  true,
    "minimumPinLength":  4,
    "pinCharacterSet":  "numeric",
    "periodBeforePinReset":  "PT0S",
    "allowedDataStorageLocations":  [

                                    ],
    "contactSyncBlocked":  true,
    "printBlocked":  true,
    "fingerprintBlocked":  false,
    "disableAppPinIfDevicePinIsSet":  false,
    "minimumRequiredOsVersion":  "13.0",
    "minimumWarningOsVersion":  null,
    "minimumRequiredAppVersion":  null,
    "minimumWarningAppVersion":  null,
    "minimumWipeOsVersion":  null,
    "minimumWipeAppVersion":  null,
    "appActionIfDeviceComplianceRequired":  "block",
    "appActionIfMaximumPinRetriesExceeded":  "block",
    "pinRequiredInsteadOfBiometricTimeout":  "PT30M",
    "allowedOutboundClipboardSharingExceptionLength":  0,
    "notificationRestriction":  "allow",
    "previousPinBlockCount":  0,
    "managedBrowser":  "microsoftEdge",
    "maximumAllowedDeviceThreatLevel":  "notConfigured",
    "mobileThreatDefenseRemediationAction":  "block",
    "blockDataIngestionIntoOrganizationDocuments":  false,
    "allowedDataIngestionLocations":  [
                                          "oneDriveForBusiness",
                                          "sharePoint",
                                          "camera"
                                      ],
    "appActionIfUnableToAuthenticateUser":  null,
    "dialerRestrictionLevel":  "allApps",
    "isAssigned":  true,
    "targetedAppManagementLevels":  "unspecified",
    "appDataEncryptionType":  "whenDeviceLocked",
    "minimumRequiredSdkVersion":  null,
    "deployedAppCount":  20,
    "faceIdBlocked":  false,
    "minimumWipeSdkVersion":  null,
    "allowedIosDeviceModels":  null,
    "appActionIfIosDeviceModelNotAllowed":  "block",
    "thirdPartyKeyboardsBlocked":  true,
    "filterOpenInToOnlyManagedApps":  true,
    "disableProtectionOfManagedOutboundOpenInData":  false,
    "protectInboundDataFromUnknownSources":  false,
    "customBrowserProtocol":  "",
    "customDialerAppProtocol":  "",
    "exemptedAppProtocols":  [
                                 {
                                     "name":  "Default",
                                     "value":  "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
                                 }
                             ],
    "apps@odata.context":  "https://graph.microsoft.com/Beta/$metadata#deviceAppManagement/iosManagedAppProtections(\u0027T_5a443fb0-d722-4d79-b946-52899ef8df5e\u0027)/apps",
    "apps":  [
                 {
                     "id":  "com.microsoft.dynamics.iphone.moca.ios",
                     "version":  "49011501",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.dynamics.iphone.moca"
                                             }
                 },
                 {
                     "id":  "com.microsoft.lync2013.iphone.ios",
                     "version":  "1849821213",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.lync2013.iphone"
                                             }
                 },
                 {
                     "id":  "com.microsoft.msapps.ios",
                     "version":  "408162834",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.msapps"
                                             }
                 },
                 {
                     "id":  "com.microsoft.msedge.ios",
                     "version":  "-2135752869",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.msedge"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.excel.ios",
                     "version":  "-1255026913",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.office.excel"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.outlook.ios",
                     "version":  "-518090279",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.office.outlook"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.powerpoint.ios",
                     "version":  "-740777841",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.office.powerpoint"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.word.ios",
                     "version":  "922692278",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.office.word"
                                             }
                 },
                 {
                     "id":  "com.microsoft.officemobile.ios",
                     "version":  "-803819540",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.officemobile"
                                             }
                 },
                 {
                     "id":  "com.microsoft.onenote.ios",
                     "version":  "107156768",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.onenote"
                                             }
                 },
                 {
                     "id":  "com.microsoft.plannermobile.ios",
                     "version":  "-175532278",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.plannermobile"
                                             }
                 },
                 {
                     "id":  "com.microsoft.powerbimobile.ios",
                     "version":  "-91595494",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.powerbimobile"
                                             }
                 },
                 {
                     "id":  "com.microsoft.procsimo.ios",
                     "version":  "-1388599138",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.procsimo"
                                             }
                 },
                 {
                     "id":  "com.microsoft.sharepoint.ios",
                     "version":  "-585639021",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.sharepoint"
                                             }
                 },
                 {
                     "id":  "com.microsoft.skydrive.ios",
                     "version":  "-108719121",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.skydrive"
                                             }
                 },
                 {
                     "id":  "com.microsoft.skype.teams.ios",
                     "version":  "-1040529574",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.skype.teams"
                                             }
                 },
                 {
                     "id":  "com.microsoft.stream.ios",
                     "version":  "126860698",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.stream"
                                             }
                 },
                 {
                     "id":  "com.microsoft.to-do.ios",
                     "version":  "-292160221",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.to-do"
                                             }
                 },
                 {
                     "id":  "com.microsoft.visio.ios",
                     "version":  "-387333446",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "com.microsoft.visio"
                                             }
                 },
                 {
                     "id":  "wefwef.ios",
                     "version":  "207428455",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.iosMobileAppIdentifier",
                                                 "bundleId":  "wefwef"
                                             }
                 }
             ],
    "assignments@odata.context":  "https://graph.microsoft.com/Beta/$metadata#deviceAppManagement/iosManagedAppProtections(\u0027T_5a443fb0-d722-4d79-b946-52899ef8df5e\u0027)/assignments",
    "assignments":  [
                        {
                            "id":  "2d6b4486-ac5e-420f-a421-3a32dba52ea4_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Better-PC-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "7389d8aa-f13d-4463-b764-afdd066e4cd7_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Good-Mobile Device-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "8df53ab4-b879-4af9-ae4f-ae5e142391eb_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Best-PC-Users-Enabled "
                                       }
                        },
                        {
                            "id":  "c3775b4f-18cd-43b3-822e-45fc8347118c_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Better-Mobile Device-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "d7b4a18a-f8b6-4cef-9e8f-6b78b4104a1b_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Good-PC-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "f34a30fc-63b7-4c5a-8f01-14ae1c058611_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Best-Mobile Device-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "4e1124f7-70cd-400c-b87d-eca176dfd1f6_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Good-Exclude Mobile Device-Users"
                                       }
                        },
                        {
                            "id":  "66b23b17-533b-47dd-8520-81dfac4cb34d_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Better-Exclude PC-Users"
                                       }
                        },
                        {
                            "id":  "6c6a1161-370e-4423-a96a-e012d954a2d0_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Best-Exclude PC-Users"
                                       }
                        },
                        {
                            "id":  "6ed6ba09-beab-44d6-a423-b9d786f900cb_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Best-Exclude Mobile Device-Users"
                                       }
                        },
                        {
                            "id":  "88a08d80-14f4-4c6e-bdcd-c15ad678169a_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Better-Exclude-Mobile Device-Users"
                                       }
                        },
                        {
                            "id":  "a45b1e36-c256-4c47-bc7a-47cd16f42bbd_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Good-Exclude PC-Users"
                                       }
                        }
                    ],
    "@odata.type":  "#microsoft.graph.iosManagedAppProtection"
}
