{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections(apps(),assignments())/$entity",
    "displayName":  "BYOD-Android-AppProtectionPolicy",
    "description":  "",
    "createdDateTime":  "2020-11-11T14:33:26.4460201Z",
    "lastModifiedDateTime":  "2020-11-11T14:37:59Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "T_20fb44b3-03aa-4971-8df2-f5dc9a5f9cad",
    "version":  "\"14743fc0-921b-4be2-b11a-e0fc253525aa\"",
    "periodOfflineBeforeAccessCheck":  "PT12H",
    "periodOnlineBeforeAccessCheck":  "PT10M",
    "allowedInboundDataTransferSources":  "allApps",
    "allowedOutboundDataTransferDestinations":  "managedApps",
    "organizationalCredentialsRequired":  false,
    "allowedOutboundClipboardSharingLevel":  "managedAppsWithPasteIn",
    "dataBackupBlocked":  true,
    "deviceComplianceRequired":  true,
    "managedBrowserToOpenLinksRequired":  true,
    "saveAsBlocked":  true,
    "periodOfflineBeforeWipeIsEnforced":  "P90D",
    "pinRequired":  true,
    "maximumPinRetries":  5,
    "simplePinBlocked":  true,
    "minimumPinLength":  4,
    "pinCharacterSet":  "numeric",
    "periodBeforePinReset":  "PT0S",
    "allowedDataStorageLocations":  [
                                        "oneDriveForBusiness",
                                        "sharePoint"
                                    ],
    "contactSyncBlocked":  true,
    "printBlocked":  true,
    "fingerprintBlocked":  false,
    "disableAppPinIfDevicePinIsSet":  false,
    "minimumRequiredOsVersion":  "8.0",
    "minimumWarningOsVersion":  null,
    "minimumRequiredAppVersion":  null,
    "minimumWarningAppVersion":  null,
    "minimumWipeOsVersion":  null,
    "minimumWipeAppVersion":  null,
    "appActionIfDeviceComplianceRequired":  "block",
    "appActionIfMaximumPinRetriesExceeded":  "block",
    "pinRequiredInsteadOfBiometricTimeout":  "PT30M",
    "allowedOutboundClipboardSharingExceptionLength":  0,
    "notificationRestriction":  "allow",
    "previousPinBlockCount":  0,
    "managedBrowser":  "microsoftEdge",
    "maximumAllowedDeviceThreatLevel":  "notConfigured",
    "mobileThreatDefenseRemediationAction":  "block",
    "blockDataIngestionIntoOrganizationDocuments":  false,
    "allowedDataIngestionLocations":  [
                                          "oneDriveForBusiness",
                                          "sharePoint",
                                          "camera"
                                      ],
    "appActionIfUnableToAuthenticateUser":  null,
    "dialerRestrictionLevel":  "allApps",
    "isAssigned":  true,
    "targetedAppManagementLevels":  "unspecified",
    "screenCaptureBlocked":  true,
    "disableAppEncryptionIfDeviceEncryptionIsEnabled":  false,
    "encryptAppData":  true,
    "deployedAppCount":  21,
    "minimumRequiredPatchVersion":  "0000-00-00",
    "minimumWarningPatchVersion":  "0000-00-00",
    "minimumWipePatchVersion":  "0000-00-00",
    "allowedAndroidDeviceManufacturers":  null,
    "appActionIfAndroidDeviceManufacturerNotAllowed":  "block",
    "requiredAndroidSafetyNetDeviceAttestationType":  "basicIntegrityAndDeviceCertification",
    "appActionIfAndroidSafetyNetDeviceAttestationFailed":  "block",
    "requiredAndroidSafetyNetAppsVerificationType":  "none",
    "appActionIfAndroidSafetyNetAppsVerificationFailed":  "block",
    "customBrowserPackageId":  "",
    "customBrowserDisplayName":  "",
    "minimumRequiredCompanyPortalVersion":  null,
    "minimumWarningCompanyPortalVersion":  null,
    "minimumWipeCompanyPortalVersion":  null,
    "keyboardsRestricted":  true,
    "allowedAndroidDeviceModels":  [

                                   ],
    "appActionIfAndroidDeviceModelNotAllowed":  "block",
    "customDialerAppPackageId":  "",
    "customDialerAppDisplayName":  "",
    "exemptedAppPackages":  [

                            ],
    "approvedKeyboards":  [
                              {
                                  "name":  "com.google.android.inputmethod.latin",
                                  "value":  "Gboard - the Google Keyboard"
                              },
                              {
                                  "name":  "com.touchtype.swiftkey",
                                  "value":  "SwiftKey Keyboard"
                              },
                              {
                                  "name":  "com.sec.android.inputmethod",
                                  "value":  "Samsung Keyboard"
                              },
                              {
                                  "name":  "com.google.android.apps.inputmethod.hindi",
                                  "value":  "Google Indic Keyboard"
                              },
                              {
                                  "name":  "com.google.android.inputmethod.pinyin",
                                  "value":  "Google Pinyin Input"
                              },
                              {
                                  "name":  "com.google.android.inputmethod.japanese",
                                  "value":  "Google Japanese Input"
                              },
                              {
                                  "name":  "com.google.android.inputmethod.korean",
                                  "value":  "Google Korean Input"
                              },
                              {
                                  "name":  "com.google.android.apps.handwriting.ime",
                                  "value":  "Google Handwriting Input"
                              },
                              {
                                  "name":  "com.google.android.googlequicksearchbox",
                                  "value":  "Google voice typing"
                              },
                              {
                                  "name":  "com.samsung.android.svoiceime",
                                  "value":  "Samsung voice input"
                              }
                          ],
    "apps@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections(\u0027T_20fb44b3-03aa-4971-8df2-f5dc9a5f9cad\u0027)/apps",
    "apps":  [
                 {
                     "id":  "com.microsoft.crm.crmphone.android",
                     "version":  "-1708416158",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.crm.crmphone"
                                             }
                 },
                 {
                     "id":  "com.microsoft.crm.crmtablet.android",
                     "version":  "1872338160",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.crm.crmtablet"
                                             }
                 },
                 {
                     "id":  "com.microsoft.emmx.android",
                     "version":  "-725393251",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.emmx"
                                             }
                 },
                 {
                     "id":  "com.microsoft.msapps.android",
                     "version":  "986978680",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.msapps"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.excel.android",
                     "version":  "-1789826587",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.excel"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.lync15.android",
                     "version":  "-1419864878",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.lync15"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.officehub.android",
                     "version":  "-1091809935",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.officehub"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.officehubhl.android",
                     "version":  "-1175805259",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.officehubhl"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.officehubrow.android",
                     "version":  "-1861979965",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.officehubrow"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.onenote.android",
                     "version":  "186482170",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.onenote"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.outlook.android",
                     "version":  "1146701235",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.outlook"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.powerpoint.android",
                     "version":  "1411665537",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.powerpoint"
                                             }
                 },
                 {
                     "id":  "com.microsoft.office.word.android",
                     "version":  "2122351424",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.office.word"
                                             }
                 },
                 {
                     "id":  "com.microsoft.planner.android",
                     "version":  "-1658524342",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.planner"
                                             }
                 },
                 {
                     "id":  "com.microsoft.powerbim.android",
                     "version":  "1564653697",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.powerbim"
                                             }
                 },
                 {
                     "id":  "com.microsoft.sharepoint.android",
                     "version":  "84773357",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.sharepoint"
                                             }
                 },
                 {
                     "id":  "com.microsoft.skydrive.android",
                     "version":  "1887770705",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.skydrive"
                                             }
                 },
                 {
                     "id":  "com.microsoft.stream.android",
                     "version":  "648128536",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.stream"
                                             }
                 },
                 {
                     "id":  "com.microsoft.teams.android",
                     "version":  "1900143244",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.teams"
                                             }
                 },
                 {
                     "id":  "com.microsoft.todos.android",
                     "version":  "1697858135",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.microsoft.todos"
                                             }
                 },
                 {
                     "id":  "com.yammer.v1.android",
                     "version":  "-1248070370",
                     "mobileAppIdentifier":  {
                                                 "@odata.type":  "#microsoft.graph.androidMobileAppIdentifier",
                                                 "packageId":  "com.yammer.v1"
                                             }
                 }
             ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections(\u0027T_20fb44b3-03aa-4971-8df2-f5dc9a5f9cad\u0027)/assignments",
    "assignments":  [
                        {
                            "id":  "01d3e35b-69ba-44ce-8763-0873df2d6459_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Good-PC-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "399bac09-92b8-42fc-8c9d-4bdee66df7ca_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Good-Mobile Device-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "a432f575-21e1-475b-93d8-07f95fb8a674_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Best-Mobile Device-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "a8fce326-c115-43aa-8e0d-ddbd1ccbeee9_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Better-Mobile Device-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "b5111bfc-da1c-4c49-ad8a-6508c283bfe9_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Better-PC-Users-Enabled"
                                       }
                        },
                        {
                            "id":  "b57cc530-7b15-4aa3-a147-bad852439292_incl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Best-PC-Users-Enabled "
                                       }
                        },
                        {
                            "id":  "30f5dec8-82b6-40a7-8b95-4a16f4c37b50_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Good-Exclude PC-Users"
                                       }
                        },
                        {
                            "id":  "373c0963-7cab-4133-8503-b8910ceb2b6c_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Best-Exclude Mobile Device-Users"
                                       }
                        },
                        {
                            "id":  "7fb9f848-55db-4c3c-a108-78d5b561e3af_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Good-Exclude Mobile Device-Users"
                                       }
                        },
                        {
                            "id":  "a88c6964-2d58-44ed-ba9c-72dce03a800b_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Better-Exclude-Mobile Device-Users"
                                       }
                        },
                        {
                            "id":  "c2b1cd0b-6995-43ca-be77-90f3faf36d86_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Best-Exclude PC-Users"
                                       }
                        },
                        {
                            "id":  "ed630c5d-65fe-4750-9304-f9a695f2fcc3_excl",
                            "source":  "direct",
                            "sourceId":  "00000000-0000-0000-0000-000000000000",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "BYOD-Better-Exclude PC-Users"
                                       }
                        }
                    ],
    "@odata.type":  "#microsoft.graph.androidManagedAppProtection"
}
