{
    "id":  "7802a662-886e-4d1a-b00b-424986890f3b",
    "displayName":  "BYOD - Good - Require MFA for Office 365 using Browser Only on PC or Mac",
    "createdDateTime":  null,
    "modifiedDateTime":  "2020-05-21T17:09:54.9979503Z",
    "state":  "enabled",
    "conditions":  {
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes":  [
                                              "browser"
                                          ],
                       "locations":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "Office365"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ]
                                        },
                       "users":  {
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [
                                                           "e027f737-1191-4a96-a7ca-1cacd215f9f0"
                                                       ],
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 },
                       "platforms":  {
                                         "includePlatforms":  [
                                                                  "all"
                                                              ],
                                         "excludePlatforms":  [
                                                                  "android",
                                                                  "iOS"
                                                              ]
                                     }
                   },
    "grantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                                  "mfa"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      },
    "sessionControls":  {
                            "cloudAppSecurity":  null,
                            "signInFrequency":  null,
                            "persistentBrowser":  null,
                            "applicationEnforcedRestrictions":  {
                                                                    "isEnabled":  true
                                                                }
                        }
}
