{
    "id":  "c800b945-2484-454e-b13b-4b3fad9d0104",
    "displayName":  "BYOD - Better - Block access to Office 365 using Browser Only with Sign-in Risk Medium and High on PC or Mac",
    "createdDateTime":  null,
    "modifiedDateTime":  "2020-05-26T19:58:01.0422992Z",
    "state":  "disabled",
    "sessionControls":  null,
    "conditions":  {
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels":  [
                                                "high",
                                                "medium"
                                            ],
                       "clientAppTypes":  [
                                              "browser",
                                              "mobileAppsAndDesktopClients"
                                          ],
                       "platforms":  null,
                       "locations":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "Office365"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ]
                                        },
                       "users":  {
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [
                                                           "aa2d7d4e-6594-48a0-824b-ad00adb76c08"
                                                       ],
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 }
                   },
    "grantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                                  "block"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      }
}
