{
    "id":  "f6bc467e-0fb7-4a84-ba5f-c2753c39906f",
    "displayName":  "BYOD - Good - Allow Office 365 iOS and Android Only",
    "createdDateTime":  null,
    "modifiedDateTime":  "2020-05-26T19:39:33.7123179Z",
    "state":  "enabled",
    "sessionControls":  null,
    "conditions":  {
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes":  [
                                              "mobileAppsAndDesktopClients"
                                          ],
                       "locations":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "9ea1ad79-fdb6-4f9a-8bc3-2b70f96e34c7",
                                                                        "Office365"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ]
                                        },
                       "users":  {
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [
                                                           "77adfba2-42aa-4755-8d35-abd99bca4825"
                                                       ],
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 },
                       "platforms":  {
                                         "includePlatforms":  [
                                                                  "android",
                                                                  "iOS"
                                                              ],
                                         "excludePlatforms":  [

                                                              ]
                                     }
                   },
    "grantControls":  {
                          "operator":  "AND",
                          "builtInControls":  [
                                                  "mfa",
                                                  "approvedApplication"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      }
}
