{
    "id":  "c5300b70-f4fb-4f26-9ddb-370a7fafc07f",
    "displayName":  "BYOD - Good - Block Web Browser access to Office 365 iOS and Android",
    "createdDateTime":  "2020-05-19T09:37:42.6689691Z",
    "modifiedDateTime":  null,
    "state":  "enabled",
    "sessionControls":  null,
    "conditions":  {
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes":  [
                                              "browser"
                                          ],
                       "locations":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "Office365"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ]
                                        },
                       "users":  {
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [
                                                           "77adfba2-42aa-4755-8d35-abd99bca4825"
                                                       ],
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 },
                       "platforms":  {
                                         "includePlatforms":  [
                                                                  "android",
                                                                  "iOS"
                                                              ],
                                         "excludePlatforms":  [

                                                              ]
                                     }
                   },
    "grantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                                  "block"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      }
}
